/*  
    cba.h | v1.1.0 | https://github.com/jamiegibney/cba.h
  
    Single-header library for build recipes and general utilities in C.


  
    # Usage

    Add #define CBA_IMPLEMENTATION before including this file in ONE C/C++ file to
    generate the implementation:

    #include ...
    #include ...
    #define CBA_IMPLEMENTATION
    #include "cba.h"

    Before the include, you can also add:

    #define CBA_VERBOSE            to see internal logging (e.g. for errors)
    #define CBA_NO_COLOR_OUTPUT    to prevent coloured output (ANSI escape codes)
    #define CBA_PRINT_ON_REBUILD   to see messages when a program rebuilds itself

    All functions in this header are documented via comments above their definitions.
  


    # Example
  
    #define CBA_IMPLEMENTATION
    #include "cba.h"
  
    int main(int argc, char** argv) {
        // Allow the program to rebuild itself when modified.
        CBA_REBUILD(argc, argv);

        // Create a directory (also works recursively).
        assert(file_try_create_directory("build"), "failed to create build directory");

        // An array of arguments which can be run like a shell command.
        Command cmd = {0};

        // Use the CBA_COMPILER_* macros for compiler-specific flags.
        cmd_append(&cmd,
            CBA_COMPILER_C,
            CBA_COMPILER_DEBUG_FLAGS,
            CBA_COMPILER_COMMON_FLAGS,
            CBA_COMPILER_OUTPUT("build/main"),
            CBA_COMPILER_INPUTS("main.c"),
        );


    #define ping printf("PING @ %s:%04i\n", __FILE_NAME__, __LINE__)
#endif

#ifdef CBA_VERBOSE
    #define verbose_print(s, ...) print(s, ## __VA_ARGS__)
#else
    #define verbose_print(s, ...)
#endif

#define todo() panic("TODO: %s", __PRETTY_FUNCTION__)
#define unreachable() CBA_UNREACHABLE; panic("unreachable code path was hit")

#define CBA_DEF inline static

#if defined(__cplusplus)
    #define CBA_LITERAL(type) type
#else
    #define CBA_LITERAL(type) (type)
#endif

#ifndef CBA_REBUILD_FAILED_MESSAGE
    #define CBA_REBUILD_FAILED_MESSAGE(binary_name) alloc_sprintf("Failed to rebuild \"%s\"", (binary_name))
#endif
#ifndef CBA_REBUILD_COMPLETED_MESSAGE
    #define CBA_REBUILD_COMPLETED_MESSAGE(binary_name, elapsed_ns) alloc_sprintf("Rebuilt \"%s\" in %s", (binary_name), fmt_time((elapsed_ns), 0))
#endif

#ifndef CBA_REBUILD_COMMAND
    #if CBA_CLANG
        #if defined(__cplusplus)
            #define CBA_REBUILD_COMMAND(output_path, source_path) "clang++", "-DDEBUG", "-Wall", "-Wextra", "-o", output_path, source_path
        #else
            #define CBA_REBUILD_COMMAND(output_path, source_path) "clang", "-DDEBUG", "-Wall", "-Wextra", "-o", output_path, source_path
        #endif
    #elif CBA_GCC
        #if defined(__cplusplus)
            #define CBA_REBUILD_COMMAND(output_path, source_path) "g++", "-DDEBUG", "-Wall", "-Wextra", "-o", output_path, source_path
        #else
            #define CBA_REBUILD_COMMAND(output_path, source_path) "gcc", "-DDEBUG", "-Wall", "-Wextra", "-o", output_path, source_path
        #endif
    #elif CBA_MSVC
        #define CBA_REBUILD_COMMAND(output_path, source_path) "cl.exe", "/D_CRT_SECURE_NO_WARNINGS", "/DDEBUG", "/W4", "/nologo", alloc_sprintf("/Fe:%s", (output_path)), source_path
    #else
    #endif
#endif // CBA_REBUILD_COMMAND

// @mark: types

#if CBA_WINDOWS
    typedef HANDLE ProcessID;
    typedef HANDLE FileDescriptor;
    #define INVALID_HANDLE INVALID_HANDLE_VALUE
    #define CBA_MAX_PATH MAX_PATH
    #define CBA_PATH_SEPARATOR '\\'
#else
    typedef int ProcessID;
    typedef int FileDescriptor;
    #define INVALID_HANDLE (-1)
    #define CBA_MAX_PATH PATH_MAX
    #define CBA_PATH_SEPARATOR '/'
#endif

#define CBA_WHITESPACE_CHARS " \t\n\r\v\f"

typedef uint8_t   u8;
typedef uint16_t  u16;
typedef uint32_t  u32;
typedef uint64_t  u64;

typedef int8_t    i8;
typedef int16_t   i16;
typedef int32_t   i32;
typedef int64_t   i64;

typedef size_t    usize;
typedef ptrdiff_t isize;

typedef int32_t   b32;

typedef float     f32;
typedef double    f64;

#define ___CBA_STATIC_ASSERT(cond, msg) typedef char static_assert_##msg[(!!(cond))*2-1]
#define __CBA_STATIC_ASSERT(cond, line) ___CBA_STATIC_ASSERT(cond, at_line_##line)
#define _CBA_STATIC_ASSERT(cond, line)  __CBA_STATIC_ASSERT(cond, line)
#define CBA_STATIC_ASSERT(cond)         _CBA_STATIC_ASSERT(cond, __LINE__)

CBA_STATIC_ASSERT(sizeof(u8)  == sizeof(i8));
CBA_STATIC_ASSERT(sizeof(u16) == sizeof(i16));
CBA_STATIC_ASSERT(sizeof(u32) == sizeof(i32));
CBA_STATIC_ASSERT(sizeof(u64) == sizeof(i64));

CBA_STATIC_ASSERT(sizeof(u8)  == 1);
CBA_STATIC_ASSERT(sizeof(u16) == 2);
CBA_STATIC_ASSERT(sizeof(u32) == 4);
CBA_STATIC_ASSERT(sizeof(u64) == 8);

CBA_STATIC_ASSERT(sizeof(usize) == sizeof(isize));

CBA_STATIC_ASSERT(sizeof(f32) == 4);
CBA_STATIC_ASSERT(sizeof(f64) == 8);

#define U8_MIN (0x00u)
#define U8_MAX (0xffu)
#define I8_MIN (-0x7f - 1)
#define I8_MAX (0x7f)

#define U16_MIN (0x0000u)
#define U16_MAX (0xffffu)
#define I16_MIN (-0x7fff - 1)
#define I16_MAX (0x7fff)

#define U32_MIN (0x00000000u)
#define U32_MAX (0xffffffffu)
#define I32_MIN (-0x7fffffff - 1)
#define I32_MAX (0x7fffffff)

#define U64_MIN (0x0000000000000000ull)
#define U64_MAX (0xffffffffffffffffull)
#define I64_MIN (-0x7fffffffffffffffll - 1)
#define I64_MAX (0x7fffffffffffffffll)

#if CBA_64_BIT
    #define USIZE_MIN U64_MIN
    #define USIZE_MAX U64_MAX
    #define ISIZE_MIN I64_MIN
    #define ISIZE_MAX I64_MAX
#else
    #define USIZE_MIN U32_MIN
    #define USIZE_MAX U32_MAX
    #define ISIZE_MIN I32_MIN
    #define ISIZE_MAX I32_MAX
#endif

#define F32_MIN     (1.17549435e-38f)
#define F32_MAX     (3.40282347e+38f)
#define F32_EPSILON (1.19209290e-7f)
#define F64_MIN     (2.2250738585072014e-308)
#define F64_MAX     (1.7976931348623157e+308)
